Tekla Open API Reference for Tekla Structures 2025
Assembly.AssemblyTypeEnum Enumeration
 The assembly types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AssemblyTypeEnum
Public Enumeration AssemblyTypeEnum
Members
Member name | Value | Description
STEEL_ASSEMBLY | 0 |  The steel assembly type.
PRECAST_ASSEMBLY | 1 |  The precast assembly type.
IN_SITU_ASSEMBLY | 2 |  The in-situ assembly type.
TIMBER_ASSEMBLY | 3 |  The timber assembly type.
UNKNOWN_ASSEMBLY | 4 |  The unknown assembly type.
REBAR_ASSEMBLY | 5 |  The rebar assembly type.
See Also
Reference
Tekla.Structures.Model Namespace